## EMPLOYEE DETAILS

### 1 Import Data and Required Packages
####  Importing Pandas, Numpy, Matplotlib, Seaborn and Warings Library.

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
import warnings
warnings.filterwarnings('ignore')

#### Import the CSV Data as Pandas DataFrame

In [3]:
df = pd.read_csv('data/employee_data.csv')

#### Show the data frame

In [11]:
##df.head()
df.tail()
##print(df.to_string())

   sno       name  age  sex         sal
3    4    Sanjana   25    F       20000
4    5     Ashish   32    M   300000-46
5    6    Mangesh   24    M  a23456.45
6    7   James-11   35    M       50000
7    8       veni   65  NaN      566666

#### Shape of the dataset

In [7]:
df.shape

(8, 5)

Info pf the dataset

In [12]:
df.info

<bound method DataFrame.info of    sno       name  age  sex         sal
0    1       Siva   43    M       20000
1    2     Vishnu   27    M       30000
2    3       Indu   29    F       25000
3    4    Sanjana   25    F       20000
4    5     Ashish   32    M   300000-46
5    6    Mangesh   24    M  a23456.45
6    7   James-11   35    M       50000
7    8       veni   65  NaN      566666>

### 2. Data Checks to perform

- Check Missing values
- Check Duplicates
- Check data type
- Check the number of unique values of each column
- Check statistics of data set
- Check various categories present in the different categorical column

### 2.1 Check Missing values

In [16]:
df.isna().sum()

sno     0
name    0
age     0
sex     1
sal     0
dtype: int64

#### There are no missing values in the data set

### 2.2 Check Duplicates

In [21]:
#df.duplicated()
df.duplicated().sum()

0

#### There are no duplicates  values in the data set

### 2.3 Check data types

In [5]:
# Check Null and Dtypes
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sno     8 non-null      int64
 1   name    8 non-null      object
 2   age     8 non-null      int64
 3   sex     7 non-null      object
 4   sal     8 non-null      object
dtypes: int64(2), object(3)
memory usage: 448.0+ bytes

### 2.4 Checking the number of unique values of each column

In [22]:
df.nunique()

sno     8
name    8
age     8
sex     2
sal     7
dtype: int64

### 2.5 Check statistics of data set

In [23]:
df.describe()

           sno        age
count  8.00000   8.000000
mean   4.50000  35.000000
std    2.44949  13.596218
min    1.00000  24.000000
25%    2.75000  26.500000
50%    4.50000  30.500000
75%    6.25000  37.000000
max    8.00000  65.000000

### 2.6 Exploring Data

In [28]:
df.head(10)

   sno       name  age  sex         sal
0    1       Siva   43    M       20000
1    2     Vishnu   27    M       30000
2    3       Indu   29    F       25000
3    4    Sanjana   25    F       20000
4    5     Ashish   32    M   300000-46
5    6    Mangesh   24    M  a23456.45
6    7   James-11   35    M       50000
7    8       veni   65  NaN      566666

In [29]:
df.fillna("NA")

   sno       name  age sex         sal
0    1       Siva   43   M       20000
1    2     Vishnu   27   M       30000
2    3       Indu   29   F       25000
3    4    Sanjana   25   F       20000
4    5     Ashish   32   M   300000-46
5    6    Mangesh   24   M  a23456.45
6    7   James-11   35   M       50000
7    8       veni   65  NA      566666

In [30]:
print("Categories in 'sno' variable:     ",end=" " )
print(df['sno'].unique())

print("Categories in 'name' variable:  ",end=" ")
print(df['name'].unique())

print("age' variable:",end=" " )
print(df['age'].unique())

print("Categories in 'sex' variable:     ",end=" " )
print(df['sex'].unique())

print("Categories in 'sal' variable:     ",end=" " )
print(df['sal'].unique())

Categories in 'sno' variable:      [1 2 3 4 5 6 7 8]
Categories in 'name' variable:   [' Siva' ' Vishnu' ' Indu' ' Sanjana' ' Ashish' ' Mangesh' ' James-11'
 'veni']
age' variable: [43 27 29 25 32 24 35 65]
Categories in 'sex' variable:      ['M' 'F' nan]
Categories in 'sal' variable:      ['20000' '30000' '25000' '300000-46' 'a23456.45 ' '50000' '566666']

In [26]:
# define numerical & categorical columns
numeric_features = [feature for feature in df.columns if df[feature].dtype != 'O']
categorical_features = [feature for feature in df.columns if df[feature].dtype == 'O']

# print columns
print('We have {} numerical features : {}'.format(len(numeric_features), numeric_features))
print('\nWe have {} categorical features : {}'.format(len(categorical_features), categorical_features))

We have 2 numerical features : ['sno', 'age']

We have 3 categorical features : ['name', 'sex', 'sal']

In [27]:
df.head(2)

   sno     name  age sex    sal
0    1     Siva   43   M  20000
1    2   Vishnu   27   M  30000

In [17]:
reading_full = df[df['reading_score'] == 100]['average'].count()
writing_full = df[df['writing_score'] == 100]['average'].count()
math_full = df[df['math_score'] == 100]['average'].count()

print(f'Number of students with full marks in Maths: {math_full}')
print(f'Number of students with full marks in Writing: {writing_full}')
print(f'Number of students with full marks in Reading: {reading_full}')

Number of students with full marks in Maths: 7
Number of students with full marks in Writing: 14
Number of students with full marks in Reading: 17

In [18]:
reading_less_20 = df[df['reading_score'] <= 20]['average'].count()
writing_less_20 = df[df['writing_score'] <= 20]['average'].count()
math_less_20 = df[df['math_score'] <= 20]['average'].count()

print(f'Number of students with less than 20 marks in Maths: {math_less_20}')
print(f'Number of students with less than 20 marks in Writing: {writing_less_20}')
print(f'Number of students with less than 20 marks in Reading: {reading_less_20}')

Number of students with less than 20 marks in Maths: 4
Number of students with less than 20 marks in Writing: 3
Number of students with less than 20 marks in Reading: 1